Hidroponic-UMN/iot-hydroponic-esp32/lib/main-code-rack/main-code-rack.cpp
/*
 * ============================================================
 *  ESP32 Rack Sensor — With pH & TDS Calibration
 *  Hidroponik Dashboard — Lab Smart Farming C502
 * ============================================================
 *
 *  Added Features:
 *  - pH sensor calibration with offset storage
 *  - TDS sensor calibration with offset storage
 *  - Automatic offset calculation
 *  - Persistent storage using Preferences
 *
 *  CALIBRATION COMMANDS via MQTT:
 *  pH:  {"command":"KALIBRASI_PH","cmd_log":{"known_value":7.0}}
 *  TDS: {"command":"KALIBRASI_TDS","cmd_log":{"known_value":1330}}
 * ============================================================
 */
#if defined(ESP8266)
    #include <ESP8266WiFi.h>
#elif defined(ESP32)
    #include <WiFi.h>
#endif
#include <Wire.h>
#include <BH1750.h>
#include <PubSubClient.h>
#include <ArduinoJson.h>
#include <OneWire.h>
#include <DallasTemperature.h>
#include <Preferences.h>  // ★ Added for persistent storage

// ============================================================
//  ⚡ CONFIG — UBAH INI PER ESP32
// ============================================================

#define TYPE_ID         "HYDROPONIC_RACKS"
#define RACK_ID         1
#define DESC_DEVICE     "Buat Rack Hydroponic"

#define WIFI_SSID       "FUNHOUSE 1B"
#define WIFI_PASSWORD   "T554022v23"

#define MQTT_SERVER     "192.168.3.116"
#define MQTT_PORT       1883
#define MQTT_USER       "esp32-1"
#define MQTT_PASSWORD   "rack1"

#define SEND_INTERVAL   5000
#define TIME_OUT_INTERVAL   60000

// ============================================================
//  Pins Out
// ============================================================
#define SDA_PIN 21
#define SCL_PIN 22
#define ONE_WIRE_PIN 4
#define TDS_PIN 35
#define PH_PIN 33
#define US_TRIG_PIN 13
#define US_ECHO_PIN 14
#define FLOW_SENSOR_PIN 27

// ============================================================
//  Calibration Constants
// ============================================================
#define CALIBRATION_SAMPLES 50    // Number of readings to average
#define SAMPLE_DELAY 100          // Delay between samples (ms)
#define ECHO_TIMEOUT 300000        // Timeout for echo pulse (microseconds)
#define DELAY_FLOW_RATE 5000      // 5 second

// Conversion factors (adjust based on your sensor specs)
#define VREF 3.3                  // ESP32 ADC reference voltage
#define ADC_RESOLUTION 4096.0     // 12-bit ADC
#define PH_NEUTRAL_VOLTAGE 2.5    // Voltage at pH 7 (typical)
#define PH_VOLTAGE_PER_UNIT 0.18  // mV per pH unit (typical)
#define SOUND_SPEED 0.0343        // Speed of sound in air at 20°C = 343 m/s = 0.0343 cm/µs
#define FLOW_CALIBRATION_FACTOR 450.0  // Pulses per liter (adjust based on your sensor)

// ============================================================
//  Define Objects
// ============================================================
BH1750 luxmeter;
OneWire oneWire(ONE_WIRE_PIN);
DallasTemperature watertemp(&oneWire);
Preferences preferences;  // ★ Preferences object for storage

// ============================================================
//  Internal variables
// ============================================================
WiFiClient espClient;
PubSubClient mqtt(espClient);

String mac_addr = "f4c1e01b-46e7-42c5-9f69-05d67a5a6a5b";
bool isRegistered = false;
char mqtt_topic[32];
char client_id[32];
unsigned long lastSend = 0;
unsigned long timeOut = 0;

char cmd_Topic[32];
char ack_cmd_Topic[48];
char signin_topic[32];
char signin_ack[32];

// Calibration offsets (loaded from Preferences)
float ph_offset = 0.0;
float tds_offset = 0.0;
float us_slope = 1.0;     // Manual calibration slope for Ultrasonic
float us_offset = 0.0;    // Manual calibration offset for Ultrasonic

// Command definitions
const char * cmd_PH_CALIBRATION = "KALIBRASI_PH";
const char * cmd_TDS_CALIBRATION = "KALIBRASI_TDS";

/*
 * ============================================================
 *  IMPROVED CALIBRATION ALGORITHM
 *  Two-point calibration with slope + offset for better accuracy
 * ============================================================
 */

// ============================================================
//  Enhanced Calibration Storage
// ============================================================

// pH calibration data (two-point)
struct PHCalibration {
    // Calibration mode
  int num_points = 0;  // 0, 1, 2, or 3 points
  bool is_calibrated = false;

  // For 1-point: use offset only
  float offset = -161.0;

  // For 2-point: use linear (slope + offset)
  float slope = 0.07;

  // Store three calibration points
  float point1_voltage = 2310.0;
  float point1_ph = 7.0;

  float point2_voltage = 2355.0;
  float point2_ph = 4.0;
};

// TDS calibration data (two-point)
struct TDSCalibration {
  float slope = 1.0;
  float offset = 0.0;
  bool is_calibrated = false;

  float point1_voltage = 0.0;
  float point1_tds = 0.0;
  float point2_voltage = 0.0;
  float point2_tds = 1330.0;
  int num_points = 0;
};

PHCalibration ph_cal;
TDSCalibration tds_cal;


// ============================================================
// Global Variables for Flow Rate Calculation
// ============================================================
uint32_t pulseCount = 0;                // Total pulses counted
uint32_t lastPulseTime = 0;             // Timestamp of last pulse
float flowRate = 0.0;                   // Current flow rate in L/min
float totalVolume = 0.0;                // Total volume in liters
unsigned long flowStartTime = 0;        // Start time for flow measurement

// ============================================================
// INTERRUPT SERVICE ROUTINE (ISR)
// Called every time a pulse is detected
// ============================================================
void IRAM_ATTR flowSensorISR() {
  pulseCount++;
  lastPulseTime = millis();
}


// ============================================================
//  Load calibration data from Preferences
// ============================================================
void loadCalibrationData() {
  preferences.begin("calibration", false);

  // Load pH calibration
  ph_cal.slope = preferences.getFloat("ph_slope", -0.07);
  ph_cal.offset = preferences.getFloat("ph_offset", 161.00);
  ph_cal.is_calibrated = preferences.getBool("ph_cal", false);
  ph_cal.num_points = preferences.getInt("ph_points", 0);
  ph_cal.point1_voltage = preferences.getFloat("ph_p1_v", 2310.0);
  ph_cal.point1_ph = preferences.getFloat("ph_p1_ph", 7.0);
  ph_cal.point2_voltage = preferences.getFloat("ph_p2_v", 2355.0);
  ph_cal.point2_ph = preferences.getFloat("ph_p2_ph", 4.0);

  // Load TDS calibration
  tds_cal.slope = preferences.getFloat("tds_slope", 1.0);
  tds_cal.offset = preferences.getFloat("tds_offset", 0.0);
  tds_cal.is_calibrated = preferences.getBool("tds_cal", false);
  tds_cal.num_points = preferences.getInt("tds_points", 0);
  tds_cal.point1_voltage = preferences.getFloat("tds_p1_v", 0.0);
  tds_cal.point1_tds = preferences.getFloat("tds_p1_tds", 0.0);
  tds_cal.point2_voltage = preferences.getFloat("tds_p2_v", 0.0);
  tds_cal.point2_tds = preferences.getFloat("tds_p2_tds", 1330.0);

