Hidroponic-UMN/iot-hydroponic-esp32/lib/main-code-rack/main-code-rack.cpp
// ============================================================
//  ★ IMPROVED TDS CONVERSION ★
//  Uses two-point calibration (slope + offset)
// ============================================================
float convertToTDS(int raw_adc, float temperature) {
  // Convert ADC to voltage
  float voltage = rawToVoltage(raw_adc);

  // Temperature compensation
  float compensationCoefficient = 1.0 + 0.02 * (temperature - 25.0);
  float compensationVoltage = voltage / compensationCoefficient;

  // Base TDS calculation (polynomial formula)
  float tds_base = (133.42 * compensationVoltage * compensationVoltage * compensationVoltage
                    - 255.86 * compensationVoltage * compensationVoltage
                    + 857.39 * compensationVoltage) * 0.5;

  // Apply calibration: TDS_calibrated = slope * TDS_base + offset
  if (!tds_cal.is_calibrated) {
    return tds_base;
  }

  if (tds_cal.num_points == 1) {
    return tds_base + tds_cal.offset;
  }

  if (tds_cal.num_points == 2) {
    return (tds_cal.slope * tds_base) + tds_cal.offset;
  }

  return tds_base;  // Return uncalibrated if not calibrated
}


float readUltraSonicSensor() {
  // Send 10µs pulse on trigger pin
  digitalWrite(US_TRIG_PIN, LOW);
  delayMicroseconds(4);  // Ensure LOW for at least 2µs

  digitalWrite(US_TRIG_PIN, HIGH);
  delayMicroseconds(10);  // HIGH for 10µs
  digitalWrite(US_TRIG_PIN, LOW);

  // Measure the duration of the echo pulse
  // pulseIn() waits for pin to go HIGH, then measures how long it stays HIGH
  unsigned long echoPulse = pulseIn(US_ECHO_PIN, HIGH, ECHO_TIMEOUT);

  if (echoPulse == 0) {
    Serial.println("Error: No echo received (timeout)");
    return 0.0;
  }

  // Calculate distance using the echo pulse width
  // Distance (cm) = (Echo_time_in_µs / 2) * speed_of_sound_in_cm/µs
  // Divided by 2 because sound travels to object AND back
  float raw_distance = (echoPulse / 2.0) * SOUND_SPEED;
  if (raw_distance < 2.0 || raw_distance > 450.0) {
    Serial.printf("Warning: Distance out of range: %.2f cm\n", raw_distance);
    return 0.0;
  }

  // Apply manual two-point calibration
  float distance = (raw_distance * us_slope) + us_offset;

  return distance;
}

float readUltraSonicSensorAverage() {
  float distanceSum = 0;
  uint8_t count = 0;

  float tmp = 0.0;
  for (uint8_t i=1;i<=10;i++) {
    tmp = readUltraSonicSensor();
    delay(60);
    if (tmp != 0.0) {
      distanceSum += tmp;
      count++;
    }
  }

  if (count > 0) {
    return (distanceSum / (float)count);
  } else {
    Serial.println("❌ No valid ultrasonic readings!");
    return 0.0;  // Return 0 instead of dividing by zero
  }
}

// ============================================================
//  ★ MANUAL ULTRASONIC CALIBRATION ★
//  Adjusts slope and offset based on two manual data points
// ============================================================
void calibrateUltrasonicSensor() {
  Serial.println("\n📏 Calibrating Ultrasonic Sensor (Two-Point)...");

  // Dummy data pairs for calibration (raw_distance, actual_distance)
  // Point 1
  float raw_d1 = 10.0;    // Replace with raw distance reading 1
  float actual_d1 = 10.5; // Replace with actual physical distance 1

  // Point 2
  float raw_d2 = 50.0;    // Replace with raw distance reading 2
  float actual_d2 = 51.2; // Replace with actual physical distance 2

  calculateTwoPointCalibration(
    raw_d1, actual_d1,
    raw_d2, actual_d2,
    us_slope, us_offset
  );

  Serial.printf("✅ Ultrasonic Calibration Updated:\n");
  Serial.printf("   Slope = %.4f\n", us_slope);
  Serial.printf("   Offset = %.4f\n\n", us_offset);
}

float readLightIntensity() {
  // Try to read from BH1750
  float lux = luxmeter.readLightLevel();

  // BH1750 returns 65535 or < 0 on error or if not configured
  if (lux == 65535.0 || lux < 0.0) {
    Serial.println("⚠️ BH1750 reading error - check sensor connection");
    return -1.0;  // Return -1 to indicate error
  }

  return lux;
}


// ============================================================
//  ★ IMPROVED pH CALIBRATION ★
//  Supports both one-point and two-point calibration
// ============================================================
bool calibratePH(float known_ph_value) {
  Serial.println("\n🧪 Starting pH Calibration...");
  Serial.printf("   Target pH: %.2f\n", known_ph_value);
  Serial.printf("   Current calibration points: %d\n", ph_cal.num_points);
  Serial.println("   Taking readings...");

  // Read raw ADC (averaged for stability)
  float voltage = readVoltage();
  float voltage_per_unit = (7.0 - 4.0) / (ph_cal.point1_voltage - ph_cal.point2_voltage);

  // Calculate base pH (without calibration)
  float base_ph = (voltage * ph_cal.slope) + ph_cal.offset;

  Serial.printf("   Voltage: %.3f mV\n", voltage);
  Serial.printf("   Base pH (uncalibrated): %.2f\n", base_ph);

  // Determine if this is first or second calibration point
  if (ph_cal.num_points == 0 || known_ph_value == 4.0) {
    // First calibration point
    Serial.println("   → Setting as calibration point 1");

    ph_cal.point1_voltage = voltage;
    ph_cal.point1_ph = known_ph_value;
    ph_cal.num_points = 1;

    Serial.printf("   One-point calibration applied\n");
    Serial.printf("   Offset: %.3f\n", ph_cal.offset);

  } else if (ph_cal.num_points == 1 || known_ph_value == 7.0) {
    // Second calibration point - enable two-point calibration
    Serial.println("   → Setting as calibration point 2");

    // Check if pH values are different enough
    if (abs(known_ph_value - ph_cal.point1_ph) < 1.0) {
      Serial.println("⚠️ Warning: Calibration points should be at least 1 pH unit apart!");
      Serial.println("   (Recommended: pH 4 and pH 7, or pH 7 and pH 10)");
    }

    ph_cal.point2_voltage = voltage;
    ph_cal.point2_ph = known_ph_value;
    ph_cal.num_points = 2;

    ph_cal.is_calibrated = true;
    Serial.println("   Two-point calibration applied!");

  } else {
    // First calibration point
    return false;
  }

  // Calculate two-point calibration
  // Map voltage range to pH range
  calculateTwoPointCalibration(
    ph_cal.point1_voltage, ph_cal.point1_ph,
    ph_cal.point2_voltage, ph_cal.point2_ph,
    ph_cal.slope, ph_cal.offset
  );

