Hidroponic-UMN/iot-hydroponic-esp32/lib/main-code-rack/main-code-rack.cpp
  // Save to flash
  saveCalibrationData();

  // Test the calibration
  float calibrated_ph = convertToPH();
  Serial.printf("   ✅ New calibrated pH: %.2f (target: %.2f)\n", calibrated_ph, known_ph_value);
  Serial.printf("   Error: %.3f pH units\n", abs(calibrated_ph - known_ph_value));
  Serial.println("✅ pH Calibration Complete!\n");

  return true;
}


// ============================================================
//  ★ IMPROVED TDS CALIBRATION ★
//  Supports both one-point and two-point calibration
// ============================================================
bool calibrateTDS(float known_tds_value) {
  Serial.println("\n🧪 Starting TDS Calibration...");
  Serial.printf("   Target TDS: %.2f ppm\n", known_tds_value);
  Serial.printf("   Current calibration points: %d\n", tds_cal.num_points);
  Serial.println("   Taking readings...");

  // Get water temperature for compensation
  watertemp.requestTemperatures();
  delay(100);
  float temperature = watertemp.getTempCByIndex(0);

  // Read raw ADC (averaged)
  float raw_adc = readADCAverage(TDS_PIN, CALIBRATION_SAMPLES);
  float voltage = rawToVoltage((int)raw_adc);

  // Calculate base TDS (without calibration)
  float compensationCoefficient = 1.0 + 0.02 * (temperature - 25.0);
  float compensationVoltage = voltage / compensationCoefficient;
  float base_tds = (133.42 * compensationVoltage * compensationVoltage * compensationVoltage
                    - 255.86 * compensationVoltage * compensationVoltage
                    + 857.39 * compensationVoltage) * 0.5;

  Serial.printf("   Raw ADC: %.2f\n", raw_adc);
  Serial.printf("   Voltage: %.3f V\n", voltage);
  Serial.printf("   Water Temp: %.2f°C\n", temperature);
  Serial.printf("   Base TDS (uncalibrated): %.2f ppm\n", base_tds);

  // Determine calibration point
  if ((tds_cal.num_points == 0) || (tds_cal.num_points == 1) || tds_cal.is_calibrated) {
    // First calibration point
    Serial.println("   → Setting as calibration point 1");

    tds_cal.point1_voltage = compensationVoltage;  // Store compensated voltage
    tds_cal.point1_tds = known_tds_value;
    tds_cal.num_points = 1;

    // One-point calibration
    tds_cal.slope = 1.0;
    tds_cal.offset = known_tds_value - base_tds;
    tds_cal.is_calibrated = true;

    Serial.printf("   One-point calibration applied\n");
    Serial.printf("   Offset: %.2f ppm\n", tds_cal.offset);

  }

  // Save to flash
  saveCalibrationData();

  // Test the calibration
  float calibrated_tds = convertToTDS((int)raw_adc, temperature);
  Serial.printf("   ✅ New calibrated TDS: %.2f ppm (target: %.2f ppm)\n",
                calibrated_tds, known_tds_value);
  Serial.printf("   Error: %.2f ppm\n", abs(calibrated_tds - known_tds_value));
  Serial.println("✅ TDS Calibration Complete!\n");

  return true;
}


// ============================================================
// Read Current Flow Rate (L/min)
// ============================================================
float readFlowRate() {
  // Read current pulse count
  uint32_t currentPulses = pulseCount;

  // Calculate volume from pulses
  float volume = currentPulses / FLOW_CALIBRATION_FACTOR;

  // Calculate time elapsed in minutes
  unsigned long elapsedTime = millis() - flowStartTime;
  float elapsedMinutes = elapsedTime / 60000.0;  // Convert milliseconds to minutes

  // Avoid division by zero
  if (elapsedMinutes < 0.001) {
    return 0.0;
  }

  // Flow rate = Volume / Time
  flowRate = volume / elapsedMinutes;

  return flowRate;
}


// ============================================================
// Reset Flow Measurement
// Call this to start a new flow measurement
// ============================================================
void resetFlowMeasurement() {
  pulseCount = 0;
  totalVolume = 0.0;
  flowRate = 0.0;
  flowStartTime = millis();
  lastPulseTime = millis();
}


// ============================================================
//  Reset calibration to factory defaults
// ============================================================
bool resetCalibration(const char* sensor_type) {
  Serial.printf("\n🔄 Resetting %s calibration...\n", sensor_type);

  preferences.begin("calibration", false);

  if (strcmp(sensor_type, "PH") == 0 || strcmp(sensor_type, "ALL") == 0) {
    preferences.putFloat("ph_slope", 0.07);
    preferences.putFloat("ph_offset", -161.0);
    preferences.putBool("ph_cal", false);
    preferences.putInt("ph_points", 0);
    preferences.putFloat("ph_p1_v", 2310.0);
    preferences.putFloat("ph_p1_ph", 7.0);
    preferences.putFloat("ph_p2_v", 2355.0);
    preferences.putFloat("ph_p2_ph", 4.0);

    Serial.println("   ✅ pH calibration reset");
  }

  if (strcmp(sensor_type, "TDS") == 0 || strcmp(sensor_type, "ALL") == 0) {
    tds_cal.slope = 1.0;
    tds_cal.offset = 0.0;
    tds_cal.is_calibrated = false;
    tds_cal.num_points = 0;

    preferences.putFloat("tds_slope", 1.0);
    preferences.putFloat("tds_offset", 0.0);
    preferences.putBool("tds_cal", false);
    preferences.putInt("tds_points", 0);

    Serial.println("   ✅ TDS calibration reset");
  }

  preferences.end();
  Serial.println("✅ Reset complete!\n");

  return true;
}


// ============================================================
//  Print calibration status
// ============================================================
void printCalibrationStatus() {
  Serial.println("\n📊 CALIBRATION STATUS");
  Serial.println("========================");

  // pH Status
  Serial.println("pH Sensor:");
  Serial.printf("  Calibrated: %s\n", ph_cal.is_calibrated ? "YES" : "NO");
  Serial.printf("  Points: %d\n", ph_cal.num_points);
  Serial.printf("  Slope: %.4f\n", ph_cal.slope);
  Serial.printf("  Offset: %.3f\n", ph_cal.offset);
  Serial.printf("  point1_ph: %.3f\n", ph_cal.point1_ph);
  Serial.printf("  point2_ph: %.3f\n", ph_cal.point2_ph);
  Serial.printf("  point1_voltage: %.3f\n", ph_cal.point1_voltage);
  Serial.printf("  point2_voltage: %.3f\n", ph_cal.point2_voltage);
  if (ph_cal.num_points >= 1) {
    Serial.printf("  Point 1: pH %.2f @ %.3fV\n", ph_cal.point1_ph, ph_cal.point1_voltage);
  }
  if (ph_cal.num_points >= 2) {
    Serial.printf("  Point 2: pH %.2f @ %.3fV\n", ph_cal.point2_ph, ph_cal.point2_voltage);
  }

  Serial.println("\nTDS Sensor:");
  Serial.printf("  Calibrated: %s\n", tds_cal.is_calibrated ? "YES" : "NO");
  Serial.printf("  Points: %d\n", tds_cal.num_points);
  Serial.printf("  Slope: %.4f\n", tds_cal.slope);
  Serial.printf("  Offset: %.2f ppm\n", tds_cal.offset);
  if (tds_cal.num_points >= 1) {
    Serial.printf("  Point 1: %.0f ppm @ %.3fV\n", tds_cal.point1_tds, tds_cal.point1_voltage);
  }
  if (tds_cal.num_points >= 2) {
    Serial.printf("  Point 2: %.0f ppm @ %.3fV\n", tds_cal.point2_tds, tds_cal.point2_voltage);
  }

  Serial.println("========================\n");
}

